// Threat Intel: https://socket.dev/blog/108-chrome-ext-linked-to-data-exfil-session-theft-shared-c2
let ExtensionsLinkedtoDataExfil = dynamic([
"obifanppcpchlehkjipahhphbcbjekfa",
"mdcfennpfgkngnibjbpnpaafcjnhcjno",
"mmecpiobcdbjkaijljohghhpfgngpjmk",
"bfoofgelpmalhcmedaaeogahlmbkopfd",
"cbfhnceafaenchbefokkngcbnejached",
"ogogpebnagniggbnkbpjioobomdbmdcj",
"ldmnhdllijbchflpbmnlgndfnlgmkgif",
"lnajjhohknhgemncbaomjjjpmpdigedg",
"aecccajigpipkpioaidignbgbeekglkd",
"akebbllmckjphjiojeioooidhnddnplj",
"akifdnfipbeoonhoeabdicnlcdhghmpn",
"akkkopcadaalekbdgpdikhdablkgjagd",
"alkfljfjkpiccfgbeocbbjjladigcleg",
"alllblhkgghelnejlggmmgjbkdabidie",
"amkkjdjjgiiamenbopfpdmjcleecjjgg",
"amnaljnjmgajgajelnplfmidgjgbjfhe",
"bbjdlbemjklojnbifkgameepcafflmem",
"bdnanfggeppmkfhkgmpojkhanoplkacc",
"bgdkbjcdecedfoejdfgeafdodjgfohno",
"bnchgibgpgmlickioneccggfobljmhjc",
"bpljfbcejldmgeoodnogeefaihjdgbam",
"cbnekafldflkmngbgmbnfmchjaelnhem",
"cdpiopekjeonfjeocbfebemgocjciepp",
"cehdkmmfadpplgchnbjgdngdcjmhlfcc",
"cljengcehefhflhoahaambmkknjekjib",
"clpgopiimdjcilllcjncdkoeikkkcfbi",
"cmeoegkmpbpcoabhlklbamfeidebgmdf",
"cmlbghnlnbjkdgfjlegkbjmadpbmlgjb",
"cnibdhllkgidlgmaoanhkemjeklneolk",
"cpnfioldnmhaihohppoaebillnambcgn",
"dbohcpohlgnhgjmfkakoniiplglpfhcb",
"dcamdpfclondppklabgkfaofjccpioil",
"dljlpildgknddpnahppkihgodokfjbnd",
"dlpiookhionidajbiopmaajeckifeehn",
"dmaibhbbpmdihedidicfeigilkbobcog",
"dohenclhhdfljpjlnpjnephpccbdgmmb",
"dpdemambcedffmnkfmkephnhhnclmcio",
"ejlcbfmhjbkgohopdkijfgggbikgbacb",
"eljfpgehlncincemdmmnebmnlcmfamhm",
"enmmilgindjmffoljaojkcgloakmloen",
"eoklnfefipnjfeknpmigmogeeepddcch",
"fddajeklkkggbnppabbhkdmnkdjindlo",
"fibgndhgobbaaekmnneapojgkcehaeac",
"fjfhejmbhpabkacpoddjbcfandjoacmb",
"flkdjodmoefccepdihipjdlianmkmhgc",
"fmajpchoiahphjiligpmghnhmabolhoh",
"gaafhblhbnkekenogcjniofhbicchlke",
"gbaoddbbpompjhmilbgiaapkkakldlpc",
"gbhhgipmedccnankkjchgcidiigmioio",
"gfhcdakcnpahfdealajmhcapnhhablbp",
"gipmochingljoikdjakkdolfcbphmlom",
"glofhphmolanicdaddgkmhfmjidjkaem",
"haochenfmhglpholokliifmlpafilfdc",
"hbobdcfpgonejphpemijgjddanoipbkj",
"hdmppejcahhppjhkncagagopecddokpi",
"heljkmdknlfhiecpknceodpbokeipigo",
"hiofkndodabpioiheinoiojjobadpgmj",
"hkbihmjhjmehlocilifheeaeiljabenb",
"hlmdnedepbbihmbddepemmbkenbnoegd",
"hmlnefhgicedcmebmkjdcogieefbaagl",
"hnpbijogiiaegambgpaenjbcbgaeimlf",
"ibelidmkbnjmmpjgfibbdbkamgcbnjdme",
"ihbkmfoadnfjgkpdmgcboiehapkiflme",
"ijccacgjefefdpglhclnbpfjlcbagafm",
"ijfmkphjcogaealhjgijjfjlkpdhhojk",
"ijpgccpmogehkjhdmomckpkfcpbjlmnj",
"imjmnghlhiimodfkdkgnfplhlobehnpm",
"jddinhnhplibccfmniaakhffpjpnaglp",
"jmopjanoebpdbopigcbpjhiigmjolikk",
"jnmmbmkmbkcccpihjgnhjmhhkokfdnfe",
"jodocbbdcdclkhjkibnlfhbmllcpfkfo",
"kahcolfecjbejjjadhjafmihdnifonjf",
"kblomapfkjidbbbdllmofkcakcenkmec",
"kbmindomjiejdikjaagfdbdfpnlanobi",
"kbnkkecifeppobnemkielnpagifkobki",
"kjnakdbpijigdbfepipnbafnhbcfdkga",
"kknakidneabpfgepadgpkibalcnabnnh",
"klglejfbdeipgklgaepnodpjcnhaihkd",
"kmiidcaojgeepjlccoalkdimgpfnbagj",
"lcijkepobdokkgmefebkiejhealgblle",
"lefndgfmmbdklidbkeifpgclmpnhcilg",
"lfkknbmaifjomagejflmjklcmpadmmdg",
"ljbgkfbiifhpgpipepnfefijldolkhlm",
"lmcpbhamfpbonaenickjclacodolkbdl",
"lmgenhmehbcolpikplhkoelmagdhoojn",
"maeccdadgnadblfddcmanhpofobhgfme",
"medkneifmjcpgmmibfppjpfjbkgbgebl",
"mheomooihiffmcgldolenemmplpgoahn",
"mmbbjakjlpmndjlbhihlddgcdppblpka",
"mmbkmjmlnhocfcnjmbchmflamalekbnb",
"nbgligggjfgkpphhghhjdoiefbimgooc",
"ncpdkpcgmdhhnmcjgiiifdhefmekdcnf",
"ndajcmifndknmkckdcdefkpgcodciggk",
"nelbpdjegmhhgpfcjclhdmkcglimkjpp",
"nkacmelgoeejhjgmmgflbcdhonpaplcg",
"nmegibgeklckejdlfhoadhhbgcdjnojb",
"nodobilhjanebkafmpihkpoabiggnnfl",
"oanpifaoclmgmflmddlgkikfaggejobn",
"ocflhkadmmnlbieoiiekfcdcmjcfeahe",
"odeccdcabdffpebnfancpkepjeecempn",
"oejhnncfanbaogjlbknmlgjpleachclf",
"ogbaedmbbmmipljceodeimlckohbnfan",
"ojkbafekojdcedacileemekjdfdpkbkf",
"pdgaknahllnfldmclpcllpieafkaibmf",
"peflgkmfmoijonfgcjdlpnnfdegnlaji",
"phfkdailnomcbcknpdmokejhellbecjb",
"pkghgkfjhjghinikeanecbgjehojfhdg",
"pllkanemicadpcmkfodglahcocfdgkhj"
]);
// Threat Intel: https://www.ox.security/blog/malicious-chrome-extensions-steal-chatgpt-deepseek-conversations/
let StealAIconversations = dynamic([
    "fnmihdojmnkclgjpcoonokmkhjpjechg",
    "inhcgfpbfdjbjogdfjbclgolkmhnooop"
]);
// Threat Intel: https://www.koi.ai/blog/urban-vpn-browser-extension-ai-conversations-data-collection 
let UrbanVpnEextension = dynamic([
    "eppiocemhmnlbhjplcgkofciiegomcon",
    "almalgbpmcfpdaopimbdchdliminoign",
    "feflcgofneboehfdeebcfglbodaceghj",
    "Pphgdbgldlmicfdkhondlafkiomnelnk",
    "Nimlmejbmnecnaghgmbahmbaddhjbecg",
    "Jckkfbfmofganecnnpfndfjifnimpcel",
    "Gcogpdjkkamgkakkjgeefgpcheonclca",
    "deopfbighgnpgfmhjeccdifdmhcjckoe"
]);
// Threat Intel: https://www.infosecurity-magazine.com/news/18-malicious-chrome-edge-extensions/
let LegitimateExtensionsTurnedMalicious = dynamic([
"Kgmeffmlnkfnjpgmdndccklfigfhajen",
"Dpdibkjjgbaadnnjhkmmnenkmbnhpobj",
"Gaiceihehajjahakcglkhmdbbdclbnlf",
"Mlgbkfnjdmaoldgagamcnommbbnhfnhf",
"Eckokfcjbjbgjifpcbdmengnabecdakp",
"Mgbhdehiapbjamfgekfpebmhmnmcmemg",
"cbajickflblmpjodnjoldpiicfmecmif",
"Pdbfcnhlobhoahcamoefbfodpmklgmjm",
"Eokjikchkppnkdipbiggnmlkahcdkikp",
"Ihbiedpeaicgipncdnnkikeehnjiddck",
"Jjdajogomggcjifnjgkpghcijgkbcjdi",
"Mmcnmppeeghenglmidpmjkaiamcacmgm",
"Ojdkklpgpacpicaobnhankbalkkgaafp",
"Lodeighbngipjjedfelnboplhgediclp",
"Hkjagicdaogfgdifaklcgajmgefjllmd",
"Gflkbgebojohihfnnplhbdakoipdbpdm",
"Kpilmncnoafddjpnbhepaiilgkdcieaf",
"caibdnkmpnjhjdfnomfhijhmebigcelo"
]);
// Threat Intel: https://gitlab-com.gitlab.io/gl-security/security-tech-notes/threat-intelligence-tech-notes/malicious-browser-extensions-feb-2025/
let MaliciousBrowserExtensions = dynamic([
"Mdaboflcmhejfihjcbmdiebgfchigjcf",
"Gaoflciahikhligngeccdecgfjngejlh",
"fedimamkpgiemhacbdhkkaihgofncola",
"jlhgcomgldfapimdboelilfcipigkgik",
"Jdjldbengpgdcfkljfdmakdgmfpneldd",
"deljjimclpnhngmikaiiodgggdniaooh",
"Giaoehhefkmchjbbdnahgeppblbdejmj",
"Hmooaemjmediafeacjplpbpenjnpcneg",
"Acbiaofoeebeinacmcknopaikmecdehl",
"Nlgphodeccebbcnkgmokeegopgpnjfkc",
"Fbcgkphadgmbalmlklhbdagcicajenei",
"Alplpnakfeabeiebipdmaenpmbgknjce",
"Ogcaehilgakehloljjmajoempaflmdci",
"Onomjaelhagjjojbkcafidnepbfkpnee",
"bpconcjcammlapcogcnnelfmaeghhagj",
"gdocgbfmddcfnlnpmnghmjicjognhonm"
]);
// Threat Intel: https://cybersecuritynews.com/35-google-chrome-extensions-hacked/
let ChromeExtensionSupplyChainAttack  = dynamic([
"nnpnnpemnckcfdebeekibpiijlicmpom",
"kkodiihpgodmdankclfibbiphjkfdenh",
"oaikpkmjciadfpddlpjjdapglcihgdle",
"dpggmcodlahmljkhlmpgpdcffdaoccni",
"acmfnomgphggonodopogfbmkneepfgnh",
"mnhffkhmpnefgklngfmlndmkimimbphc",
"cedgndijpacnfbdggppddacngjfdkaca",
"bbdnohkpnbkdkmnkddobeafboooinpla",
"egmennebgadmncfjafcemlecimkepcle",
"bibjgkidgpfbblifamdlkdlhgihmfohh",
"befflofjcniongenjmbkgkoljhgliihe",
"pkgciiiancapdlpcbppfkmeaieppikkk",
"llimhhconnjiflfimocjggfjdlmlhblm",
"oeiomhmbaapihbilkfkhmlajkeegnjhe",
"ekpkdmohpdnebfedjjfklhpefgpgaaji",
"epikoohpebngmakjinphfiagogjcnddm",
"miglaibdlgminlepgeifekifakochlka",
"eanofdhdfbcalhflpbdipkjjkoimeeod",
"ogbhbgkiojdollpjbhbamafmedkeockb",
"bgejafhieobnfpjlpcjjggoboebonfcg",
"igbodamhgjohafcenbcljfegbipdfjpk",
"mbindhfolmpijhodmgkloeeppmkhpmhc",
"hodiladlefdpcbemnbbcpclbmknkiaem",
"pajkjnmeojmbapicmbpliphjmcekeaac",
"ndlbedplllcgconngcnfmkadhokfaaln",
"epdjhgbipjpbbhoccdeipghoihibnfja",
"cplhlgabfijoiabgkigdafklbhhdkahj",
"jiofmdifioeejeilfkpegipdjiopiekl",
"hihblcmlaaademjlakdpicchbjnnnkbo",
"lbneaaedflankmgmfbmaplggbmjjmbae",
"eaijffijbobmnonfhilihbejadplhddo",
"hmiaoahjllhfgebflooeeefeiafpkfde"
]);
// Threat Intel: https://www.koi.ai/blog/vk-styles-500k-users-infected-by-chrome-extensions-that-hijack-vkontakte-accounts
let HijackVKontakteAccounts = dynamic([
"ceibjdigmfbbgcpkkdpmjokkokklodmc",
"mflibpdjoodmoppignjhciadahapkoch",
"lgakkahjfibfgmacigibnhcgepajgfdb",
"bndkfmmbidllaiccmpnbdonijmicaafn",
"pcdgkgbadeggbnodegejccjffnoakcoh"
]);
DeviceTvmBrowserExtensions
| where
ExtensionId has_any (ExtensionsLinkedtoDataExfil) or
ExtensionId has_any (UrbanVpnEextension) or 
ExtensionId has_any (LegitimateExtensionsTurnedMalicious) or 
ExtensionId has_any (MaliciousBrowserExtensions) or
ExtensionId has_any (ChromeExtensionSupplyChainAttack) or 
ExtensionId has_any (StealAIconversations) or
ExtensionId has_any (HijackVKontakteAccounts)
| project BrowserName, ExtensionName, ExtensionDescription, ExtensionRisk, ExtensionVendor, IsActivated
