let Lookback = 7d;
// Threat Intel: https://www.koi.ai/blog/urban-vpn-browser-extension-ai-conversations-data-collection 
let UrbanVpnEextension = dynamic([
    "eppiocemhmnlbhjplcgkofciiegomcon",
    "almalgbpmcfpdaopimbdchdliminoign",
    "feflcgofneboehfdeebcfglbodaceghj",
    "Pphgdbgldlmicfdkhondlafkiomnelnk",
    "Nimlmejbmnecnaghgmbahmbaddhjbecg",
    "Jckkfbfmofganecnnpfndfjifnimpcel",
    "Gcogpdjkkamgkakkjgeefgpcheonclca",
    "deopfbighgnpgfmhjeccdifdmhcjckoe"
]);
DeviceTvmBrowserExtensions
| where ExtensionId has_any (UrbanVpnEextension)
| project BrowserName, ExtensionName, ExtensionDescription, ExtensionRisk, ExtensionVendor, IsActivated