DeviceLogonEvents
| where ActionType == "LogonFailed" 
| summarize FailedLogonCount = count(), 
    DistinctAccounts = dcount(AccountName),
    AccountList = make_set(AccountName) 
    by DeviceName, RemoteIP, RemoteDeviceName
| where FailedLogonCount > 20 and DistinctAccounts >= 5
| project-rename PotentialPasswordSpray = FailedLogonCount
| extend Timestamp = now(), HostCustomEntity = DeviceName, IPCustomEntity = RemoteIP