DeviceProcessEvents
| where FileName =~ "lsass.exe"
| where InitiatingProcessFileName in~ ("powershell.exe", "cmd.exe", "rundll32.exe", "wmic.exe", "procdump.exe", "taskmgr.exe", "comsvcs.exe")
| project Timestamp, DeviceName, InitiatingProcessAccountName, FileName, InitiatingProcessFileName, ProcessCommandLine
